[{
    "id": 1,
    "order": "gc-recruiting",
    "title": "New Hire Recruiting",
    "company": "Greycomm Studios",
    "timeframe": "July - September 2015",
    "images": ["https://static1.squarespace.com/static/546fc106e4b007974054777d/54748e0ae4b0e7532cedb0bd/56b9fa9c60b5e93ef6c9195a/1487787681788/interestmeeting.png?format=1500w"],
    "type": "print/online",
    "role": "visual direction",
    "description": "Flyers and social media advertisements encouraging entry-level digital media specialists (in film, graphic design and broadcasting) to apply for volunteer, intern and part-time roles as part of the crew.",
    "reason": "Prior to the campaign, students were reached through internal referral. In order to boost the applicant pool with more talent, I designed and conceptualized the visual direction of the campaign in order to represent our brands as creative and open to the ideas of people new to the field.",
    "process": "In the initial stages, I reviewed the history of previous years- and found that, as one would assume, much of the best years in applicant numbers were due to higher emrollments of communications students compared to the lower performing years. Due to this, my team decided to reach towards more universities than previous years. In developing the visual direction of the posters, I based artistic direction on a combination of the studio brand and more modern trending styles of the time.",
    "result": "With our Facebook account containing a reach towards students majoring in film and digital media studies, we were able to obtain applications to outside universities as well. Due to the influx of 100+ applications, we were able to go over our targeted applicant pool and find talent not associated with the company prior; and soon-to-be future managers!"
  }, {
    "id": 2,
    "order": "women-of-color-art-direction",
    "title": "Out-Of-Home Ads and Social Media promotion",
    "company": "For the Women of Color Conference, Baltimore, MD",
    "timeframe": "September - December 2014",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555427479/work/ooh/wocc.jpg"],
    "type": "print/online",
    "role": "visual and brand direction",
    "description": "As a committee chair and art director of the Women of Color Conference conducted at Loyola University, I collaborated with a committee to create a campaign to gain participant sign-ups from students and professionals who identify with the title.",
    "reason": "Prior to the non-profit’s launch, the university it was held at had little resources to network students who identified as women/LGBTQ/people of color. Given that this event was created to connect women in competitive environments, we sought to convey appreciation for what everyone brings to the table, whether it’s the classroom or a workplace.  This was the 2nd conference from the organization, however, so there needed to be a visual identity and promotion of the event since there was little in place compared to the previous year. ",
    "process": "Since we had little metrics to follow up on (small attendance and lack of social media presence were factors from the year before), I compared the conference to similar ones before it. Advertisement avenues and visual directions were some of the features of those I researched to gain an understanding of what target audiences were viewing. However, despite that there were many networking events to compare our own to, there were few that doubled as a platform for difficult conversations. Since there were members of the committee that were also educators, I took their feedback in conjunction with designing the initial proposed visuals. Based on their insight and comparisons to other networking events, I created a visual direction to invoke a “storybook” feel in order to make it more personal to potential participants. ",
    "result": "As a result, we boosted the number of participants from a few hundred to 1,000+ while attracting promoters who understood our mission to connect women from all backgrounds. By giving its brand identity more structure, the designs I provided were used for the following years, as well."
  },
  {
    "id": 3,
    "order": "ccsj-hiring",
    "title": "Volunteer Recruitment",
    "company": "Community Center for Service and Justice",
    "timeframe": "January 2015",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555423478/work/ooh/springservice.jpg"],
    "type": "print/online",
    "role": "creative conceptualization of social media, OOH flyers and e-mail campaigns",
    "description": "Loyola University’s Community Center for Service and Justice has a yearly initiative to gain targeted enrollments of volunteers for their non-profit partners. As part of the push to do so, the center holds 'open houses' where community leaders and volunteer directors can introduce and discuss the issues happening in the city in order to educate and motivate students/entry professionals.",
    "reason": "In order to promote this, I was tasked with conceptualizing a new visual direction of the event. Prior to the creation of the campaign, similar efforts lacked brand identity and were too dry for audiences to really connect with or understanding the point of the event. Social media, email campaigns and OOH flyers were to be posted in universities, businesses and community partner offices. ",
    "process": "In the early stages, I compared multiple results of previous campaigns for the event. The most glaring issue, however, was that it was treated as a one-off event, rather than taking advantage of the fact that it could be used as a strong indicator of both brand voice and the organization as a whole. The other, of course, was that ads were not placed in areas were the target audience frequented, so attendees were overly restricted to freshman students. Considering this, I went with the route of designing the visual with a combination of creative trends at the time, and an illustration of a prominent Baltimore community. At CCSJ, one of their mission statements is to educate students that the city is more than its reputation seen in the media, so I aimed to incorporate that in the visuals. ",
    "result": "As a result, the event had to be broken into separate open houses due to an influx of attendees. Personally, however, I found the most exciting part of the results was that we had cast a ‘wider net’ on volunteers; no longer was is predominantly first-year students but also all students and community members seeking to make a change. Since its creation, the original sets have been used to promote the yearly events."
  },
  {
    "id": 4,
    "order": "fh-holidays",
    "title": "Pre-Holiday sales email campaign",
    "company": "FH Group International",
    "timeframe": "November 2016",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555424297/work/emails/blackfriday-thanksgivingpreview6.jpg", "https://res.cloudinary.com/diuubtvqd/image/upload/v1555424297/work/emails/cybermon2016.jpg"],
    "type": "online",
    "role": "creative conceptualization of e-mail campaigns",
    "description": "This project was a month-long process of grabbing customer metrics in order to pinpoint what items were the most popular or clicked on. It also doubled as a way to promote our sales ahead of time compared to the competition.",
    "reason": "Therefore, as a designer, I took the approach of making our brand voice more unique through making the image the focal point of the email. Rather than make customers wait for multiple images and skip to the next email, they would be hit with one focus image. After initial concepts and approval from the art director, we aimed to invoke a sense of home to go with the holiday. Using photography I took for the project itself, I built together a scene that highlighted our top-selling products. ",
    "process": "In the early stages, I compared multiple results of previous campaigns for the event. The most glaring issue, however, was that it was treated as a one-off event, rather than taking advantage of the fact that it could be used as a strong indicator of both brand voice and the organization as a whole. The other, of course, was that ads were not placed in areas were the target audience frequented, so attendees were overly restricted to freshman students. Considering this, I went with the route of designing the visual with a combination of creative trends at the time, and an illustration of a prominent Baltimore community. At CCSJ, one of their mission statements is to educate students that the city is more than its reputation seen in the media, so I aimed to incorporate that in the visuals. ",
    "result": "We analyzed that a majority of the traffic to the website was coming from people who had newsletter sign-ups. From this, we were also able to keep track of the effectiveness of our emails in general, and took advantage of Mailchimp’s features to gain a better insight to our customers before the end of the year sales. "
  },
  {
    "id": 5,
    "order": "fifth-item",
    "title": "Holiday sales event",
    "company": "FH Group International",
    "timeframe": "December-January 2016",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555424296/work/emails/4b.jpg", "https://res.cloudinary.com/diuubtvqd/image/upload/v1555424296/work/emails/2alt-b.jpg"],
    "type": "online",
    "role": "creative conceptualization of e-mail campaigns",
    "description": "This project was created and re-iterated on for the holiday season in 2016. Our primary goal was to stay up to speed with competition sales, as well as boost customer loyalty/interest.",
    "reason": "Using what we gathered from the sales in our November campaign, we highlighted the features of our products further and also modeled the design to cater to our 18-30-year old customers. Since they were primarily in this age range, we aimed to keep our design modern, with simplified controls for the user to focus in on their specific product interest.",
    "process": "Since I had already known the effectiveness of the visual direction for previous campaigns, I decided to take more risk in the creative visuals. Taking inspiration from the art direction for Japan’s Starbucks’ holiday themes, we were able to go a little off our usual brand design. ",
    "result": "As a result, we met our targeted sales goal for the season; interestingly, however, the items that were trending in sales shifted to more bold colors. In addition, due to its popularity, this visual style was followed for similar sales events."
  },
  {
    "id": 6,
    "order": "sixth-item",
    "title": "Bombas promotions",
    "company": "Sircle Media",
    "timeframe": "March-June 2015",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555424191/work/sm/bombas-skateboard.png", "https://res.cloudinary.com/diuubtvqd/image/upload/v1555424190/work/sm/bombas-fd.png"],
    "type": "online",
    "role": "creative conceptualization as an assistant to the marketing team",
    "description": "For this social media marketing company, I was challenged with creating 2 social media holiday campaigns (in addition to smaller designs not shown here). Their client, Bombas, is an athletics company that targeted consumers all the way from children to adults.",
    "reason": "In order to maintain their social media presence, they also needed to attract new customers. So in addition to the designs being used as posts, they were also used in Facebook ad space.",
    "process": "While researching their previous posts, the ones that seemed to gain the most attraction and clicks from users were the ones that had more “out of the box” photography. Since socks aren’t typically what the target users tend to seek out, their brand style is focused on its voice and tone. Thus, when coming up with designs, I took this approach and ran with it in the visuals. It was particularly daunting because, while Bombas relied heavily on social media presence for advertising, it was also my first work with them.",
    "result": "With the leadership of the marketing team, we posted images accordingly to the best time of day, with catchy copy, etc. We were then able to go above our targeted website traffic after the posts gained momentum, and received positive feedback from the client on the design-side. Best of all; they requested to work with me for more projects! (whew)"
  },
  {
    "id": 7,
    "order": "seventh-item",
    "title": "Avitae Summer Campaigns",
    "company": "Sircle Media",
    "timeframe": "May-August 2015",
    "images": [],
    "type": "online",
    "role": "Designer, concept",
    "description": "",
    "reason": "",
    "process": "",
    "result": ""
  },
  {
    "id": 8,
    "order": "ei-item",
    "title": "Ginnybakes",
    "company": "Sircle Media",
    "timeframe": "March-April 2015",
    "images": [],
    "type": "online",
    "role": "Designer, concept",
    "description": "",
    "reason": "",
    "process": "",
    "result": ""
  },
  {
    "id": 9,
    "order": "greycomm-ads",
    "title": "Advertisements for Workshops in Broadcasting",
    "company": "Greycomm Studios",
    "timeframe": "September 2015",
    "images": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555424014/work/greymugfinal.png", "https://res.cloudinary.com/diuubtvqd/image/upload/v1555424013/work/greycommsticker.png"],
    "type": "online and out-of-home",
    "role": "Art direction (conceptualizing)",
    "description": "This project was a 3-month advertisement campaign that aimed to generate interest in workshops created by Greycomm Studios, Loyola University. Targeted at entry-level professionals to students, these ads were placed throughout college campuses and social media accounts. Promotional items (mugs, stickers) were also given to those who signed up or visited the studio.",
    "reason": "",
    "process": "",
    "result": ""
  }

]