[
  {
    "id": 1,
    "category": "web",
    "endpoint": "itslit",
    "title": "It's Lit",
    "company": "N/A",
    "type": "Social",
    "timeframe": "February - March 2018",
    "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423410/work/lit.jpg",
    "tech": ["JavaScript", "HTML5", "CSS", "MySQL"],
    "libapi": [
      "Node JS",
      "Express",
      "jQuery",
      "Google Maps",
      "Google Books",
      "Passport JS"
    ],
    "role": "full stack development",
    "prevdesc": "This social app is targeted for users seeking to exchange books in their local area. Bulit in Express, Node and JavaSctipt.",
    "description": "This social app is targeted for users seeking to exchange books in their local area. The user simply signs up, records the books they own, and can seek out other users looking for books. ",
    "problem": "The idea came from observing the lack of connection in online book-lover forums. Although there is a lot of avenues of selling books online/in person, my co-developers and I observed that there’s more opportunity to expand beyond those current options. Rather than focus on the transactional purpose of sending off your books, there was a lack of connection in a similar manner to a local book club or the “little free library”.  Therefore, we were interested in incorporating the more personable aspect of it such as libraries, book stores etc. that seem to have slipped by the wayside.  ",
    "process": "In our team of 4 developers, we all divided tasks based on priority since we were balanced in terms of strengths in front and back end development. After a condensed “design sprint” of compared similar existing websites and wireframing as a group, we decided on the stack we were using quickly. Given our tight turnaround, I used jQuery for quick DOM manipulation and a mixture of custom CSS with the library, Materialize. Once we had a prototype of working interactions, we agreed on using MySQL for the need of relational data; since interactions between users would be based on comparing data (such as checking if a book has been “checked out”), it was the most fitting at the time. By choosing MySQL, also were able to take advantage of Passport JS for easy control of the authentication process.  Once we planned out what we needed for the back end, we connected the Google Books API with “dummy” user accounts to produce the basis of the experience.",
    "future": "As a result, we had a functioning MVP of our initial idea. Users can sign up and browse books, while being able to view who is available in their local area. For future development, we are seeking to build and integrate a chat, rather than falling back of emails between users. ",
    "github": "https://github.com/elrizal/its-lit",
    "live": "http://sleepy-peak-84439.herokuapp.com/"
  },
  {
    "id": 2,
    "category": "web",
    "endpoint": "cookwithnana",
    "title": "Cook With Nana",
    "company": "N/A",
    "timeframe": "February - March 2018",
    "type": "Social",
    "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423410/work/cwn.jpg",
    "tech": ["JavaScript", "HTML5", "CSS", "MySQL"],
    "libapi": [
      "React JS",
      "Node JS",
      "Express",
      "Google Maps",
      "Passport JS",
      "Sequelize"
    ],
    "prevdesc": "Cook With Nana is a social React app created to connect people who want to learn or teach cooking; also created in Node, Express and Sequelize.",
    "role": "front end development, UX design (wireframed and conducted usability testing)",
    "description": "In order to create a platform for seniors to connect with younger generations, Cook With Nana was an idea that came out of brainstorming with other developers. We saw the lack of apps targeted towards older generations, and saw it as a huge opportunity to build a social app in order to approach the problem more. Using culinary arts as a way to attract many users, the app serves as a way for the elderly to meet and/or discuss ways of aiding people become better chefs.",
    "problem": "With a group of co-developers, we were curious about creating an application that aimed at groups that fall under overlooked target demographics. In particular, we noticed a lack of sites that are both easily accessible and have targeted use for elderly generations of women. Based on quick research about the group, the most frequented site for senior citizens is Facebook, but it is used primarily to connect with their existing connections. Therefore, we saw room for opportunities to assist people in building those connections outside of their circle. So the idea for Cook With Nana was born; the app would be an avenue for younger and older generations to connect and learn from one another.",
    "process": "My co-developers and I had first discovered React, and saw the immediate benefits of it for our idea. Since wanted to have separate options and features depending on whether someone is offering cooking advice vs seeking it, using conditional rendering would be a huge boon to the interaction development process. Once we agreed on using React, we also turned to using relational data paired with the Sequelize library in order to speed up how we designed and implemented our data with the client side. ",
    "future": "Although using React for the first time was challenging (especially since we were all coming from jQuery/Vanilla JS), we managed to complete our MVP with both testing and real users. For future development, however, we are planning to integrate a one on one video call in order to improve communication between users. Given our target audience, improving the accessibility of the UI is also a huge focus in the next reiterations.",
    "github": "https://github.com/elrizal/CookWithNana",
    "live": "https://peaceful-woodland-77310.herokuapp.com/"
  },
  {
    "id": 5,
    "category": "web",
    "endpoint": "eqzone",
    "title": "Equipment Zone Product Spotlight",
    "company": "N/A",
    "timeframe": "May 2018; 2 weeks",
    "type": "Ecommerce",
    "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423791/work/72.jpg",
    "tech": ["JavaScript", "HTML5", "CSS", "PHP"],
    "libapi": ["jQuery"],
    "prevdesc": "As a web developer at Equipment Zone, I created separate campaign pages, as well as replacing legacy code on both the client and server side. * the demo is no longer live.",
    "role": "front end development",
    "description": "The demo presets a landing page for a promotion created for one of Equipment Zone's latest models.",
    "problem": "Initially, the product pages for EZ contained legacy code that bogged down performance and the overall users' experience. In addition to reducing the user pain points around this, I decided to revamp the overall UI to align with the company's main brand. ",
    "process": "Although being apart of the site, the approach I took was similar to a 'microsite'. The visual design is ",
    "future": "",
    "live": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423946/work/f72.gif"
  }
]
