[
  {
    "id": 1,
    "category":"uxui", "endpoint": "insurance",
    "title": "Enrollment for life insurance form",
    "company": "Adams Direct & Media's insurance client",
    "timeframe": "October 2018 - March 2019",
    "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423410/work/enroll.jpg",
    "imglink":"https://res.cloudinary.com/diuubtvqd/image/upload/v1555404288/Export_Da4c42255d98fca3c142f50eec2ed0fb0-compressed.pdf",
    "stagesimgs": ["", ""],
    "tasks": "competitive and heuristic analysis, usability testing, wire framing, prototyping and client side web development",
    "description": "As a UX developer, I was tacked with prototyping this enrollment form for our client looking to improve enrollment form experience for customers. Having a recent re-brand and change of code base, we needed to integrate previous builds of similar applications we’ve created with traditional-paper format that customers typically use. ",
    "reason": "Due to relying on customers mailing out submissions and back-and-forth communication with client-service, the company had difficulty in keeping track of customer data. The process turned out to be frustrating on both sides, so the client needed to find a way to both modernize and reduce the headache of the process.",
    "process": "To start off, the initial data I received was the target demographic group (parts aged 30-50 and senior citizens) and trends in hot-spot clicking and previous successful enrollment campaigns. Before designing anything, I kicked off supplemental research with the lowest hanging fruit first; looking for customer reviews of both the client online and paper forms for comparison. Given that we had relatively similar forms in the past, I found them to be a useful basis in identifying elements I could use. Another quick research method I started with was actually filling out the forms and going about the form as different personas (such as single parents, people with multiple illnesses etc.). After gathering initial feedback, my first wireframe was used as a way to communicate to stakeholders my direction. The reiterative process was then based on usability tests with participants in-house and to targeted demographics. From doing so, I found that the initial design lead users to spend a lower average of time on filling the form and that little to no errors in filling personal information (given the added options to edit as you go). ",
    "result": "Following re-iteration on the initial prototype, I was able to develop the client-side interactions with collaboration of our back-end engineering team. As a result of the research and quick development phases, we were able to deliver a high-fidelity prototype to the client. Due to high traffic and lack of users reporting to customer service, we then used this project as a template for future enrollment forms. "
  },
  {
    "id": 2,
    "category":"uxui", "endpoint": "eq-uiguide",
    "title": "UI Design Guide",
    "company": "Equipment Zone",
    "timeframe": "April 2018 - June 2018",
    "invision":"",
    "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423411/work/ez-prev.png",
    "imglink":"https://indd.adobe.com/view/55060eb5-04ee-4d77-a88b-4dfa1a28802b",
    "research":"",
    "personas":"",
    "tasks": "Brand designing, heuristic analysis, surveying",
    "description": "This brand features new standards for the front end and design team at Equipment Zone to follow in endpoint to reach strong accessibility and visual brand standards. ",
    "reason": "Prior to the guide, I saw that there were many visual hierarchy inconsistencies and multiple violations of accessibility standards being met (small font sizes, low contrast on font to backgrounds and colors not communicating semantics). The company also had previous issues in communicating style standards, but did not have an initial brand guide. So while it was not a img project assigned to me, I saw a lot of opportunity to improve these issues by creating this reference.",
    "process": "The process was fairly straight forward; I compared the current design and interactions to the W3.org Web Content Accessibility Guidelines. The company also had fragmented pieces of design elements due to prior lack of a in-house design department. Therefore, the biggest challenge to come out of the process was consolidating previous designs along with elements I purposed based off of accessibility issues. ",
    "result": "As a result, the guide opened up more discussion in planning and producing new content, both print and online. Rather than having visual consistency and accessibility be handled as an afterthought, the guide was used as a good “jumping off point” in turning the team towards considering all aspects of the customer experience. "
  },
    {
      "id": 3,
      "category":"uxui", "endpoint": "wherefor",
      "title": "Where For redesign",
      "company": "Capstone project at Springboard",
      "timeframe": "December 2016 - August 2017",
      "imglink":"https://projects.invisionapp.com/share/EPCMF4WV5#/screens",
      "img": "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423791/work/ux.jpg",
      "stagesimgs": ["https://res.cloudinary.com/diuubtvqd/image/upload/v1555423581/work/uxui/userflows.png", 
        "https://res.cloudinary.com/diuubtvqd/image/upload/v1555423581/work/uxui/brand-wherefor2.jpg"],
      "wireframes":"https://drive.google.com/file/d/0B3oo1iO2KDAMRXdpV2dfcFdqM3M/view",
      "research":"https://drive.google.com/file/d/0B3oo1iO2KDAMbnB5Z3JKWHB4bWc/view",
      "personas":"https://www.slideshare.net/ErinLeighRizal/springboard-ux-school-personas-for-whereforcom",
      "tasks": "Surveying target users, identifying pain point, heuristic analysis, usability testing and wireframing ",
      "description": "Inspired by the recent budget travel site to hit the savvy wonder-luster's radar, Where For, I chose it as the basis for a re-design during my UX design course at Springboard. As an already amazing site on its own, I wanted to see how much further I could take it with the knowledge I picked up in the course. The site has a simple premise- plug in a budget for travel and then search away flights and hotels you can book on-site. ",
      "reason":  "The site is picking up steam and highly recognized across the web, yet, why stop at plugging in values and searching? Some individuals come in at a disadvantage when it comes to finding the time, money and organization of a trip may not have the chance to throw in a large budget and get a slew of results. Therefore, in planning the project, my goal was to focus on empowering millennials, new travelers and busy families in planning their trip when cash is tight and travel-know-how is low.",
      "process": "In the research phase of the product, I started off by the most easily accessible method to learn about my users. By surveying over 100+ travelers from sites such as Reddit and Facebook, the most common user-pain points were finding/organizing groups of travelers with them and finding experiences that weren’t “generic” ie., commercialized tours. From here, I built three different users base ooff of the surveys. “Meghan” represented the working professional with budget concerns, “Brendan” was the travel-green-horn and “John” who is travel savvy and financially comfortable but not exactly time-rich. After drafting their user flows and doing a brief card-sorting exercise for building information architecture, I decided that I had enough insight into the wire framing stage. After building the prototype, 5 participants representing the target audience were given tasks core to the site. For the focus on evaluating the effectiveness of the flow of the site, the design was kept tailored to mobile phone view (iOS) to be implemented into other platforms in ongoing use.",
      "result":"As I researched, designed and researched again, I was constantly surprised by what my participants expected. In traveling, even people from a relatively narrow age group (say 19-30s for the target of my own) have varying experiences planning to go abroad or even a road trip. My current prototype is vastly different from how I imagined- since it simplified rather than try to fit every user's need. My goal to create resource for people looking to engage with a culture may not go as planned for users that do not engage with the site. However, I found that keeping the process quick and at their finger tips may be a good start in helping users rushing into something they're unfamiliar with. As a participant said, 'not even a month is enough to immerse yourself in another country' but with ongoing communication with locals, users could potentially expand their experience in another place online even after they've left; and that's exactly what I'll aim to do as I refine my research and UI design in the future."
    }
    ]
